frain1219/ZHIYUN_F100/SDK/APM32F10x_SDK_V2.0.0/Utilities/SVD/APM32F103xD.svd
                <register>
                    <name>SMPTIM2</name>
                    <displayName>SMPTIM2</displayName>
                    <description>sample time register 2</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SMPCYCCFG0</name>
                            <description>Channel 0 sample time selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG1</name>
                            <description>Channel 1 sample time selection</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG2</name>
                            <description>Channel 2 sample time selection</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG3</name>
                            <description>Channel 3 sample time selection</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG4</name>
                            <description>Channel 4 sample time selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG5</name>
                            <description>Channel 5 sample time selection</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG6</name>
                            <description>Channel 6 sample time selection</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG7</name>
                            <description>Channel 7 sample time selection</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG8</name>
                            <description>Channel 8 sample time selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMPCYCCFG9</name>
                            <description>Channel 9 sample time selection</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDOF1</name>
                    <displayName>INJDOF1</displayName>
                    <description>injected channel data offset register 1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDOF1</name>
                            <description>Data offset for injected channel 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDOF2</name>
                    <displayName>INJDOF2</displayName>
                    <description>injected channel data offset register 2</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDOF2</name>
                            <description>Data offset for injected channel 2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDOF3</name>
                    <displayName>INJDOF3</displayName>
                    <description>injected channel data offset register 3</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDOF3</name>
                            <description>Data offset for injected channel 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDOF4</name>
                    <displayName>INJDOF4</displayName>
                    <description>injected channel data offset register 4</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDOF4</name>
                            <description>Data offset for injected channel 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDHT</name>
                    <displayName>AWDHT</displayName>
                    <description>watchdog higher threshold register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000FFF</resetValue>
                    <fields>
                        <field>
                            <name>AWDHT</name>
                            <description>Analog watchdog higher threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDLT</name>
                    <displayName>AWDLT</displayName>
                    <description>watchdog lower threshold register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AWDLT</name>
                            <description>Analog watchdog lower threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REGSEQ1</name>
                    <displayName>REGSEQ1</displayName>
                    <description>regular sequence register 1</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REGSEQC13</name>
                            <description>13th conversion in regular sequence</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC14</name>
                            <description>14th conversion in regular sequence</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC15</name>
                            <description>15th conversion in regular sequence</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC16</name>
                            <description>16th conversion in regular sequence</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQLEN</name>
                            <description>Regular channel sequence length</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REGSEQ2</name>
                    <displayName>REGSEQ2</displayName>
                    <description>regular sequence register 2</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REGSEQC12</name>
                            <description>12th conversion in regular sequence</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC11</name>
                            <description>11th conversion in regular sequence</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC10</name>
                            <description>10th conversion in regular sequence</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC9</name>
                            <description>9th conversion in regular sequence</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC8</name>
                            <description>8th conversion in regular sequence</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC7</name>
                            <description>7th conversion in regular sequence</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REGSEQ3</name>
                    <displayName>REGSEQ3</displayName>
                    <description>regular sequence register 3</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REGSEQC6</name>
                            <description>6th conversion in regular sequence</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC5</name>
                            <description>5th conversion in regular sequence</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC4</name>
                            <description>4th conversion in regular sequence</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC3</name>
                            <description>3rd conversion in regular sequence</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC2</name>
                            <description>2nd conversion in regular sequence</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>REGSEQC1</name>
                            <description>1st conversion in regular sequence</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJSEQ</name>
                    <displayName>INJSEQ</displayName>
                    <description>injected sequence register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJSEQLEN</name>
                            <description>Injected sequence length</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>INJSEQC4</name>
                            <description>4th conversion in injected sequence</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>INJSEQC3</name>
                            <description>3rd conversion in injected sequence</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>INJSEQC2</name>
                            <description>2nd conversion in injected sequence</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>INJSEQC1</name>
                            <description>1st conversion in injected sequence</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDATA1</name>
                    <displayName>INJDATA1</displayName>
                    <description>injected data register 1</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDATA</name>
                            <description>Injected data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDATA2</name>
                    <displayName>INJDATA2</displayName>
                    <description>injected data register 2</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDATA</name>
                            <description>Injected data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDATA3</name>
                    <displayName>INJDATA3</displayName>
                    <description>injected data register 3</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDATA</name>
                            <description>Injected data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INJDATA4</name>
                    <displayName>INJDATA4</displayName>
                    <description>injected data register 4</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INJDATA</name>
                            <description>Injected data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REGDATA</name>
                    <displayName>REGDATA</displayName>
                    <description>regular data register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REGDATA</name>
                            <description>Regular data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>ADC2DATA</name>
                            <description>ADC2 data</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
